# Этот файл "Settings.ini" используется для настроек параметров скрипта 'GenUpdates.cmd'. 
# Файл "Settings.ini" должен быть в кодировке Unicode (UCS-2 LE BOM).

[Settings]
# Переменная update_folder указывает на относительный путь к папке с обновлениями и расширениями. Для текущей папки оставить пустой.
# Пример: update_folder=Updates 01\x64
update_folder=

# Переменная sort_list указывает порядок сортировки списка обновлений. Может принимать значение time, -time, abc или -abc
# time сортировка по дате\времени от ранних к поздним, -time сортировка по дате\времени от поздних к ранним, abc сортировка по алфавиту, -abc cортировка по обратному алфавиту. 
# Опциональный параметр, по умолчанию используется: sort_list=time
sort_list=

# Выбор поля времени для сортировки. Может использоваться время создания файла sort_time=1, время последнего использования sort_time=2 или время последнего изменения sort_time=3.
# Опциональный параметр, по умолчанию используется время последнего изменения: sort_time=3
sort_time=

# Переменная text_editor указывает текстовый редактор для использования. Пример: text_editor=C:\Program Files\My Text Editor\TextEditor++.exe
# Опциональный параметр, по умолчанию будет использоваться notepad++, если notepad++ не установлен - по умолчанию будет использоваться системный notepad.
text_editor=

# Имя будущего сгенерированного CMD файла для установки обновлений.
# Опциональный парамет, по умолчанию имя генерируется из update_folder и текущей даты.
cmd_name=

# Переменная filter_ext указывает фильтр расширений файлов для обновлений. Пример: filter_ext=.msu .cab .exe .msi .psf .esd
# Опциональный парамет, по умолчанию используется: filter_ext=.msu .exe .cab .msi
filter_ext=


